<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd"><html><head></head><body>


	
	

<h1>biografia de tim berns lee</h1>
<p>Berners-Lee trabaj&#243; en el CERN desde junio hasta diciembre de 1980. Durante ese tiempo, propuso un proyecto basado en el hipertexto para facilitar la forma de compartir y la puesta al d&#237;a de la informaci&#243;n entre investigadores. En este periodo tambi&#233;n construy&#243; un programa llamado <itali><b> ENQUIRE </b></itali>que no lleg&#243; a ver la luz.1​</p>
<p>Despu&#233;s de dejar el CERN, en 1980, se fue a trabajar a la empresa de <i>LJohn Poole Image Computer Systems td</i>., pero regres&#243; al CERN otra vez en 1984.</p>

<h2>enlacamiento de la web</h2>
<p>En 1989, el CERN era el nodo de Internet m&#225;s grande de Europa y Berners-Lee vio la oportunidad de unir Internet y el hipertexto (<b>HTTP</b> y <b>HTML</b>), de lo que surgir&#237;a la <b>World Wide Web</b>. </p>
<p>Desarroll&#243; su primera propuesta de la Web el 12 de marzo de 1989,2​ pero no tuvo mucho eco, por lo que en 1990 y con la ayuda de <i>Robert Cailliau</i>, hicieron una revisi&#243;n que fue aceptada por su gerente, <i>Mike Sendall</i>.</p>
<blockquote><p> Us&#243; ideas similares a las que hab&#237;a usado en el sistema Enquire, para crear la <b>World Wide Web</b>, para esto dise&#241;&#243; y construy&#243; el primer navegador (llamado WorldWideWeb y desarrollado con NEXTSTEP) y el primer servidor Web al que llam&#243; httpd (HyperText Transfer Protocol daemon).</p></blockquote>


<h2> la democratizacion de la web </h2>
<p>El primer servidor Web se encontraba en el CERN y fue puesto en l&#237;nea el 6 de agosto de 1991. Esto proporcion&#243; una explicaci&#243;n sobre lo que era el World Wide Web, c&#243;mo uno podr&#237;a tener un navegador y c&#243;mo establecer un servidor Web. Este fue tambi&#233;n el primer directorio Web del mundo, ya que Berners-Lee mantuvo una lista de otros sitios Web aparte del suyo.</p>
<p>Debido a que tanto el software del servidor como del cliente fue liberado de forma gratuita desde el CERN, el coraz&#243;n de Internet Europeo en esa &#233;poca, su difusi&#243;n fue muy r&#225;pida. El n&#250;mero de servidores Web pas&#243; de veintis&#233;is en 1992 a doscientos en octubre de 1995 lo que refleja cual fue la velocidad de la difusi&#243;n de internet.</p>

<h2> nacimiento del W3C</h2>
<p>En 1994 entr&#243; en el <i>Laboratorio de Ciencias de la Computaci&#243;n e Inteligencia Artificial del Massachusetts Institute of Technology.</i> Se traslad&#243; a EE. UU. y puso en marcha el W3C, que dirige actualmente.</p>
<blockquote><p> El <b>W3C</b> es un organismo internacional de estandarizaci&#243;n de tecnolog&#237;as Web dirigido conjuntamente por el Instituto Tecnol&#243;gico de Massachusetts, el ERCIM franc&#233;s y la <i> Universidad de Keiō en Jap&#243;n</i>. Este organismo decidi&#243; que todos sus est&#225;ndares fuesen libres, es decir, que los pudiese utilizar todo el mundo libremente sin coste alguno, lo que sin lugar a dudas fue una de las grandes razones para que la Web haya llegado a tener la importancia que tiene hoy en d&#237;a.</p></blockquote>
<footer>En su libro Tejiendo la red, publicado en 1999, Berners-Lee explica por qu&#233; <b>la tecnolog&#237;a web es libre y gratis. Se considera al mismo tiempo el inventor y el protector de la web</b>.</footer>


<script type="module" src="https://s.brightspace.com/lib/bsi/20.22.10-212/unbundled/mathjax.js"></script><script type="text/javascript">document.addEventListener('DOMContentLoaded', function() {
					if (document.querySelector('math') || /\$\$|\\\(|\\\[|\\begin{|\\ref{|\\eqref{/.test(document.body.innerHTML)) {
						document.querySelectorAll('mspace[linebreak="newline"]').forEach(elm => {
							elm.setAttribute('style', 'display: block; height: 0.5rem;');
						});

						window.D2L.MathJax.loadMathJax({
							'outputScale': 1.3,
							'renderLatex': false
						});
					}
				});</script><script type="module" src="https://s.brightspace.com/lib/bsi/20.22.10-212/unbundled/prism.js"></script><script type="text/javascript">document.addEventListener('DOMContentLoaded', function() {
					document.querySelectorAll('.d2l-code').forEach(code => {
						window.D2L.Prism.formatCodeElement(code);
					});
				});</script></body></html>